Revit 2024 API
BoundaryConditions.SetOrientTo Method
 Sets the boundary condition orientation option.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public void SetOrientTo(
	BoundaryConditionsOrientTo orientTo
)
Visual Basic
Public Sub SetOrientTo ( _
	orientTo As BoundaryConditionsOrientTo _
)
Visual C++
public:
void SetOrientTo(
	BoundaryConditionsOrientTo orientTo
)
Parameters
orientTo
Type: Autodesk.Revit.DB.Structure.BoundaryConditionsOrientTo
 The new orientation option.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace